# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 80  # number of classes

backbone:
  # [from, number, module, args]
  - [-1, 1, Timm, [2048, 'resnet101', True, True, 0, True]]  # 0: resnet101 backbone
  - [0, 1, Index, [512, 2]]     # 1: P3 - [1, 512, 80, 80]
  - [0, 1, Index, [1024, 3]]    # 2: P4 - [1, 1024, 40, 40]
  - [0, 1, Index, [2048, 4]]    # 3: P5 - [1, 2048, 20, 20]
  - [-1, 1, SPPF, [2048, 5]]    # 4: SPPF on P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]   # cat P4
  - [-1, 3, C2f, [512]]         # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]   # cat P3
  - [-1, 3, C2f, [256]]         # 10 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]   # cat head P4
  - [-1, 3, C2f, [512]]         # 13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]   # cat head P5
  - [-1, 3, C2f, [1024]]        # 16 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]]  # Detect(P3, P4, P5)

